# ---------------------------------------------------
# 문제 1
# ---------------------------------------------------
city = input("본인의 고향 도시를 입력하세요: ")
blood_type = input("본인의 혈액형을 입력하세요: ")
fav_season = input("본인의 최애 계졀을 입력하세요: ")
height = input("본인의 키를 입력하세요: ")
phone = input("본인의 전화번호를 입력하세요: ")
nationality = input("본인의 국적을 입력하세요: ")

print(city, blood_type, fav_season, height, phone, nationality)

# ---------------------------------------------------
# 문제 2
# ---------------------------------------------------
mbti = 'INFP'
blood = 'A'
gender = 'M'
height = 171.7
weight = 77

notice = "[ 신상 정보 ]"

# 여러데이터 출력 방식
print('[ 신상 정보 ]', '\nMBTI : ', mbti, '    혈액형 : ', blood, '    성별 : ', gender, '\n몸무게 : ', weight, '     키 : ', height)

# 서식지정자 출력 방식
print("%s \nMBTI : %s \t혈액형 : %s \t성별 : %s \n몸무게 : %d \t\t키 : %.1f" % (notice, mbti, blood, gender, weight, height))

# F-스트링 출력 방식
print(f'{notice} \nMBTI : {mbti} \t혈액형 : {blood} \t성별 : {gender} \n몸무게 : {weight} \t\t키 : {height}')

# ---------------------------------------------------
# 문제 3
# ---------------------------------------------------
print(f'데이터 50\t=>', type(50), "타입")
print(f'데이터 0.91\t=>', type(0.91), "타입")
print(f'데이터 Winter =>', type("Winter"), "타입")
print(f'데이터 False\t=>', type(False), "타입")

country_to_visit = input("꼭 가보고 싶은 나라는?")
print(f"당신은 {country_to_visit}에 꼭 가보고 싶군요!")

# ---------------------------------------------------
# 문제 4
# ---------------------------------------------------
'''
정답
힙 영역 - 데이터 즉 객체 저장
스택 영역 - 변수 저장
'''

# ---------------------------------------------------
# 문제 5
# ---------------------------------------------------
'''
정답 (5-1)
integer
float
str
bool

정답 (5-2)
2진수
8진수
16진수
'''

# ---------------------------------------------------
# 문제 6
# ---------------------------------------------------
garo = int(input("직육면체 가로길이(cm) : "))
sero = int(input("직육면체 세로길이(cm) : "))
nopi = int(input("직육면체 높이길이(cm) : "))

print(f"직사각형 넓이 : {garo*sero}\n직육면체 부피 : {garo*sero*nopi}")
