# ---------------------------------------------------------------
# 다양한 함수의 형태 - (3) return 키워드
# - 함수 종료 및 호출한 곳으로 돌아가게 하는 기능
#   결과값이 함께 있다면 결과값을 가지고 돌아감
#   여러 개의 값 반환 가능
#   함수 중간에 빠져나가기
# ---------------------------------------------------------------
# 함수 기능 : 팩토리얼을 계산 후 계산결과를 반환해주는 기능
# 함수 이름 : factorial
# 매개 변수 : 정수 1개
# 반 환 값 : 팩토리얼 결과
# -----------------------------------------------------
def factorial(x):
    if not x:
        return 1    # 즉시 함수 종류 후 호출한 곳으로 반환
    ret = 1
    if x:
        for n in range(x, 0, -1):
            ret *= n
    return ret

print(f' 0! = {factorial(0)}')
print(f' 3! = {factorial(3)}')
