# -----------------------------------------------------------
# str 데이터 타입 연산
# -----------------------------------------------------------

# 산술 연산 => 덧셈, 뺄셈, 곱셈, 나눗셈, ...
msg1 = "Good"
msg2 = "Happy"

# 덧셈연산 ----------------------------------------------------
print(f'msg1 + msg2 => {msg1 + msg2}')

# 뺄셈 연산 ----------------------------------------------------
# 미지원
# print(f'msg1 * msg2 => {msg1 - msg2}')

# 곱셈 연산 ----------------------------------------------------
print(f'msg1 * 10 => {msg1 * 10}')

# ------------------------------------------------------------
# 비교 연산 ~ > < >= <= == !=
# - str 안에 있는 원소 / 요소 단위로 비교 된다.
# ------------------------------------------------------------
print(f'"H" < "I" => {"H" < "I"}, {ord("H")}, {ord("I")}')
print(f'"H" < "h" => {"H" < "h"}, {ord("H")}, {ord("h")}')
print(f'"HA" > "Ha" => {"HA" < "Ha"}')


# ------------------------------------------------------------
# 논리 연산 => and, or, not
# - not 문자열
# ------------------------------------------------------------
print(bool("Happy"))    # True
print(not "Happy")      # False
print(bool(5))          # True
print(not 5)            # False
print(bool(' '))        # True
print(bool(''))         # False (empty string)


# -------------------------------------------------------------
# 멤버 연산자 => 원소/요소가 있는 데이터 타입의 경우 사용
# - 요소 in 데이터     : 요소가 데이터에 포함되어 있는 경우 True
# - 요소 not in 데이터 : 요소가 데이터에 포함되지 않은 경우 True
# -------------------------------------------------------------
print(f'"H" in "Happy" : {"H" in "Happy"}')
print(f'"H" not in "Happy" : {"H" not in "Happy"}')
