# ------------------------------------------------------------------
# [요청] 사용자가 알고싶어하는 단을 입력 받아서 해당 단의 구구단을 출력
#       단, while 반복문 사용'
# ------------------------------------------------------------------

DEBUG1 = False
if DEBUG1:
    dan = int(input('알고싶은 단 입력 : '))

    print(f'{str(dan)+"단":-^10}')

    y = 1
    while y < 10:
        print(f'{dan} * {y} = {dan * y:<2d}')
        y += 1

# [요청] 2단 ~ 9단 출력. 단, while 반복문 사용
DEBUG2 = True
if DEBUG2:
    x = 2
    while x < 10:
        print(f'{x:->5}{"단":-<5}')
        y = 1
        while y < 10:
            print(f'{x} * {y} = {x * y:<2d}')
            y += 1
        x += 1
